###  Combine two DataFrame 

* concat function 


#### merge function 

* Inner Join 
* Outer Join 
* Left Outer Join 
* Right Outer Join

In [1]:
import pandas as pd

In [2]:
student_marks_exam_1= { "Name" : ['Alex','Denis'],
                        "Marks" :[ 10,20]}

In [3]:
student_marks_exam_2= { "Name" : ['Alex','Lewis'],
                        "Marks" :[ 30,50]}

In [6]:
df1= pd.DataFrame(student_marks_exam_1)
df2= pd.DataFrame(student_marks_exam_2)

In [7]:
df1

    Name  Marks
0   Alex     10
1  Denis     20

In [8]:
df2

    Name  Marks
0   Alex     30
1  Lewis     50

In [9]:
df3=pd.concat([df1,df2]).reset_index(drop=True)

In [10]:
df3.index

RangeIndex(start=0, stop=4, step=1)

In [11]:
pd.merge(df1,df2,on="Name",how="inner")

   Name  Marks_x  Marks_y
0  Alex       10       30

In [12]:
pd.merge(df1,df2,on="Name",how="outer")

    Name  Marks_x  Marks_y
0   Alex     10.0     30.0
1  Denis     20.0      NaN
2  Lewis      NaN     50.0

In [13]:
pd.merge(df1,df2,on="Name",how="left")

    Name  Marks_x  Marks_y
0   Alex       10     30.0
1  Denis       20      NaN

In [14]:
pd.merge(df1,df2,on="Name",how="right")

    Name  Marks_x  Marks_y
0   Alex     10.0       30
1  Lewis      NaN       50